//RD09A2      JOB
/*
/* SET OUTFILE DD NAME TO MATCH YOUR ASSIGN NAME FOR FILE
/* SET LRECL 125 FOR OUTFILE TO MATCH YOUR OUTPUT RECORD SIZE
/*
//EDITEX     EXEC PGM=EDIT
//STEPLIB      DD DSN=KC03D09.DCMAFD01.COBOL.LOADLIB,
//    DISP=SHR

//INFILE       DD DSN=KC03D09.DCMAFD02.A2.POSDAT1.DATA,
//    DISP=SHR

//RPTFILE      DD DSN=KC03D09.DCMAFD02.A2.EDIT.REPORT.ERROR,
//    DISP=(NEW,CATLG,DELETE),
//    SPACE=(TRK,(2,1)),
//    RECFM=F,
//    LRECL=125

//VALFILE      DD DSN=KC03D09.DCMAFD02.A2.EDIT.VALID.DATA,
//    DISP=(NEW,CATLG,DELETE),
//    SPACE=(TRK,(2,1)),
//    RECFM=F,
//    LRECL=36

//INVFILE      DD DSN=KC03D09.DCMAFD02.A2.EDIT.INVALID.DATA,
//    DISP=(NEW,CATLG,DELETE),
//    SPACE=(TRK,(2,1)),
//    RECFM=F,
//    LRECL=36
/*
