//RD09A2      JOB
/*
/* SET OUTFILE DD NAME TO MATCH YOUR ASSIGN NAME FOR FILE
/* SET LRECL 77 FOR OUTFILE TO MATCH YOUR OUTPUT RECORD SIZE
/*
//RETURNEX   EXEC PGM=RETURN
//STEPLIB      DD DSN=KC03D09.DCMAFD01.COBOL.LOADLIB,
//    DISP=SHR

//INFILE       DD DSN=KC03D09.DCMAFD02.A2.SPLIT.RETURNS.DATA,
//    DISP=SHR

//OUTFILE      DD DSN=KC03D09.DCMAFD02.A2.RETURNS.REPORT,
//    DISP=(NEW,CATLG,DELETE),
//    SPACE=(TRK,(2,1)),
//    RECFM=F,
//    LRECL=84
/*
