//RD09A2      JOB
/*
/* SET OUTFILE DD NAME TO MATCH YOUR ASSIGN NAME FOR FILE
/* SET LRECL 77 FOR OUTFILE TO MATCH YOUR OUTPUT RECORD SIZE
/*
//SL         EXEC PGM=SL
//STEPLIB      DD DSN=KC03D09.DCMAFD01.COBOL.LOADLIB,
//    DISP=SHR

//INFILE       DD DSN=KC03D09.DCMAFD02.A2.SPLIT.SL.DATA,
//    DISP=SHR

//OUTFILE          DD DSN=KC03D09.DCMAFD02.A2.SL.REPORT,
//    DISP=(NEW,CATLG,DELETE),
//    SPACE=(TRK,(2,1)),
//    RECFM=F,
//    LRECL=77
/*
