//RD09A2      JOB
/*
/* SET OUTFILE DD NAME TO MATCH YOUR ASSIGN NAME FOR FILE
/* SET LRECL 101 FOR OUTFILE TO MATCH YOUR OUTPUT RECORD SIZE
/*
//SPLITEX     EXEC PGM=SPLITTER
//STEPLIB      DD DSN=KC03D09.DCMAFD01.COBOL.LOADLIB,
//    DISP=SHR

//INFILE       DD DSN=KC03D09.DCMAFD02.A2.EDIT.VALID.DATA,
//    DISP=SHR

//RPT          DD DSN=KC03D09.DCMAFD02.A2.SPLIT.REPORT.CONTROL,
//    DISP=(NEW,CATLG,DELETE),
//    SPACE=(TRK,(2,1)),
//    RECFM=F,
//    LRECL=101

//SL           DD DSN=KC03D09.DCMAFD02.A2.SPLIT.SL.DATA,
//    DISP=(NEW,CATLG,DELETE),
//    SPACE=(TRK,(2,1)),
//    RECFM=F,
//    LRECL=36

//RET          DD DSN=KC03D09.DCMAFD02.A2.SPLIT.RETURNS.DATA,
//    DISP=(NEW,CATLG,DELETE),
//    SPACE=(TRK,(2,1)),
//    RECFM=F,
//    LRECL=36
/*
