        IDENTIFICATION DIVISION.
        PROGRAM-ID. A7SPLIT.
        DATE-WRITTEN. MARCH 20, 2023.
        AUTHOR. RAMIYAN GANGATHARAN.
      * DESCRIPTION: COBOL FILE FOR ASSIGNMENT 7.

        ENVIRONMENT DIVISION.
        CONFIGURATION SECTION.

        INPUT-OUTPUT SECTION.
        FILE-CONTROL.

      *     DATA FILE FROM ASSIGNMENT 6
            SELECT INPUT-FILE
                ASSIGN TO "INFILE"
                ORGANIZATION IS SEQUENTIAL.

      *     REPORT FILE
            SELECT OUTPUT-FILE
                ASSIGN TO "OUTFILE"
                ORGANIZATION IS SEQUENTIAL.

      *    DATA FILE FOR SALES AND LAYAWAYS
           SELECT SALE_LAY_OUTFILE
                ASSIGN TO "SOUTFILE"
                ORGANIZATION IS SEQUENTIAL.

      *    DATA FILE FOR RETURNS
           SELECT RETURNED_OUTFILE
                ASSIGN TO "ROUTFILE"
                ORGANIZATION IS SEQUENTIAL.

        DATA DIVISION.
        FILE SECTION.

        FD INPUT-FILE
            RECORDING MODE IS F
            RECORD CONTAINS 108 CHARACTERS.

      * THIS SPLITS UP THE DATA INTO USABLE CHUNKS FROM THE RAW DATA.
       01 INPUT-LINE.
          05 IL-TRANSACTION-CODE        PIC X(1).
          05 IL-TRANSACTION-AMOUNT      PIC 9(5)V99.
          05 IL-PAYMENT-TYPE            PIC X(2).
          05 IL-STORE-NUMBER            PIC 9(2).
          05 IL-INVOICE-NUMBER          PIC X(9).
          05 SPLIT-INVOICE REDEFINES IL-INVOICE-NUMBER.
             10 INVOICE-PREFIX-1        PIC X(1).
             10 INVOICE-PREFIX-2        PIC X(1).
             10 DASH                    PIC X(1).
             10 INVOICE-NUMBER          PIC X(6).
          05 IL-SKU                     PIC X(15).

        FD OUTPUT-FILE
            RECORDING MODE IS F
            RECORD CONTAINS 108 CHARACTERS.
       01 OUTPUT-LINE                   PIC X(108).

        FD SALE_LAY_OUTFILE
           RECORDING MODE IS F
           RECORD CONTAINS 108 CHARACTERS.
       01 SALE_LAY_OUTLINE              PIC X(108).

       FD RETURNED_OUTFILE
           RECORDING MODE IS F
           RECORD CONTAINS 108 CHARACTERS.
       01 RETURNED_OUTLINE              PIC X(108).

        WORKING-STORAGE SECTION.

      * LEVEL 88 VARIABLES FOR END OF FILE VALIDATION
       01 END-OF-FILE                   PIC X(1).
          88 EOF                                       VALUE 'Y'.
          88 NOT-EOF                                   VALUE 'N'.

      * LEVEL 88 VARIABLES FOR TRANSACTION TYPE VALIDATION
       01 WS-TRANS-CODE-SALES-OPTIONS   PIC X(1).
          88 TCSO-SALES                                VALUE 'S'.
          88 TCSO-LAYAWAYS                             VALUE 'L'.
          88 TCSO-RETURNED                             VALUE 'R'.

      * LEVEL 88 VARIABLES FOR PAYMENT TYPES VALIDATION.
       01 WS-PAYMENT-TYPE-OPTIONS       PIC X(2).
          88 PTO-DEBIT                                 VALUE 'DB'.
          88 PTO-CREDIT                                VALUE 'CR'.
          88 PTO-CASH                                  VALUE 'CA'.

      * LEVEL 88 VARIABLES FOR ALL VALID STORE NUMBERS.
       01 WS-STORE-CODES                PIC 9(2).
          88 STORE-ONE                                 VALUE 01.
          88 STORE-TWO                                 VALUE 02.
          88 STORE-THREE                               VALUE 03.
          88 STORE-FOUR                                VALUE 04.
          88 STORE-FIVE                                VALUE 05.
          88 STORE-TWELVE                              VALUE 12.

      * THESE VARIABLES COUNT HOW MANY ROWS HAVE A CERTAIN CODE.
       01 WS-SALES-COUNT                PIC 9(3).
       01 WS-LAYAWAY-COUNT              PIC 9(3).
       01 WS-RETURN-COUNT               PIC 9(3).

      * THIS VARIABLE IS RESPONSIBLE FOR ADDING SALES AND
       01 WS-SL-TOTAL-COUNT             PIC 9(3).

      * THIS VARIABLE COUNTS ALL ROWS PROCESSED.
       01 WS-TOTAL-ROW-COUNTER          PIC 9(3).

      * THESE VARIABLES COUNT HOW MANY ROWS HAVE A CERTAIN TYPE.
       01 WS-TOTAL-DEBIT-COUNTER        PIC 9(3).
       01 WS-TOTAL-CREDIT-COUNTER       PIC 9(3).
       01 WS-TOTAL-CASH-COUNTER         PIC 9(3).

      * THESE VARIABLES ARE USED TO ADD UP THE MONETARY AMOUNT/TRANS CODE.
       01 WS-TOTAL-S-AMOUNT             PIC 9(8)V99.
       01 WS-TOTAL-L-AMOUNT             PIC 9(8)V99.
       01 WS-TOTAL-R-AMOUNT             PIC 9(8)V99.
       01 WS-TOTAL-SL-AMOUNT            PIC 9(8)V99.

       01 WS-TOTAL-S-AMOUNT-TALLY       PIC 9(8)V99.
       01 WS-TOTAL-L-AMOUNT-TALLY       PIC 9(8)V99.
       01 WS-TOTAL-R-AMOUNT-TALLY       PIC 9(8)V99.
       01 WS-TOTAL-SL-AMOUNT-TALLY      PIC 9(8)V99.


      * ALL THESE VARIABLES BELOW COUNT THE OCCURANCES OF EACH STORE NUMBER.
       01 WS-STORE-NUMBER               PIC 9(2).

      * SALES AND LAYAWAYS
       01 WS-STORE-ONE-COUNT            PIC 9(6)V99.
       01 WS-STORE-TWO-COUNT            PIC 9(6)V99.
       01 WS-STORE-THREE-COUNT          PIC 9(6)V99.
       01 WS-STORE-FOUR-COUNT           PIC 9(6)V99.
       01 WS-STORE-FIVE-COUNT           PIC 9(6)V99.
       01 WS-STORE-TWELVE-COUNT         PIC 9(6)V99.

       01 WS-STORE-ONE-REC-COUNT        PIC 9(2).
       01 WS-STORE-TWO-REC-COUNT        PIC 9(2).
       01 WS-STORE-THREE-REC-COUNT      PIC 9(2).
       01 WS-STORE-FOUR-REC-COUNT       PIC 9(2).
       01 WS-STORE-FIVE-REC-COUNT       PIC 9(2).
       01 WS-STORE-TWELVE-REC-COUNT     PIC 9(2).

      * RETURNS
       01 WS-STORE-ONE-R-COUNT          PIC 9(3)V99.
       01 WS-STORE-TWO-R-COUNT          PIC 9(3)V99.
       01 WS-STORE-THREE-R-COUNT        PIC 9(3)V99.
       01 WS-STORE-FOUR-R-COUNT         PIC 9(3)V99.
       01 WS-STORE-FIVE-R-COUNT         PIC 9(3)V99.
       01 WS-STORE-TWELVE-R-COUNT       PIC 9(3)V99.


      * THESE VARIABLES ARE USED TO CALCULATE PERCENTAGES PER PAYMENT TYPE.
       01 WS-CREDIT-DECIMAL             PIC 9(3)V9(3).
       01 WS-DEBIT-DECIMAL              PIC 9(3)V9(3).
       01 WS-CASH-DECIMAL               PIC 9(3)V9(3).

       01 WS-CREDIT-PERCENT             PIC 9(2)V9(3).
       01 WS-DEBIT-PERCENT              PIC 9(2)V9(3).
       01 WS-CASH-PERCENT               PIC 9(2)V9(3).

      * THIS WAS AN ATTEMPT TO DO DECIMAL CONVERSION BUT IS NOT USED.
       01 WS-HUNDRED                    PIC 9V9        VALUE 1.


      * THESE VARIABLES ARE GROUPED TOGETHER AS THEY ARE RESPONSIBLE
      * FOR CALCULATING TOTALS.
       01 WS-TOTAL-TRANSACTIONS         PIC 9(5).
       01 WS-TRANSACTION-CODE           PIC X(1).
       01 WS-TOTAL-DB-CR                PIC 9(5).
       01 WS-SUBTOTAL                   PIC 9(8)V99.
       01 WS-GRAND-TOTAL                PIC 9(8)V99.

      * THESE ARE THE VARIABLES USED FOR DISPLAY PURPOSES FOR THE
      * REPORT TO MAKE THEM MORE AESTHETICALLY PLEASING.
       01 WS-SALES-COUNT-STR            PIC Z(3).
       01 WS-LAYAWAY-COUNT-STR          PIC Z(3).
       01 WS-RETURN-COUNT-STR           PIC Z(3).
       01 WS-SL-TOTAL-COUNT-STR         PIC Z(3).
       01 WS-TOTAL-ROW-COUNTER-STR      PIC Z(3).

       01 WS-TOTAL-DEBIT-COUNTER-STR    PIC Z(3).
       01 WS-TOTAL-CREDIT-COUNTER-STR   PIC Z(3).
       01 WS-TOTAL-CASH-COUNTER-STR     PIC Z(3).

       01 WS-TOTAL-S-AMOUNT-STR         PIC $ZZ,ZZ9.99.
       01 WS-TOTAL-L-AMOUNT-STR         PIC $ZZ,ZZ9.99.
       01 WS-TOTAL-R-AMOUNT-STR         PIC $ZZ,ZZ9.99.
       01 WS-TOTAL-SL-AMOUNT-STR        PIC $ZZ,ZZ9.99.

       01 WS-TOTAL-TRANSACTIONS-STR     PIC Z(3).
       01 WS-GRAND-TOTAL-STR            PIC $ZZ,ZZ9.99.

       01 WS-STORE-ONE-REC-COUNT-STR    PIC Z(2).
       01 WS-STORE-TWO-REC-COUNT-STR    PIC Z(2).
       01 WS-STORE-THREE-REC-COUNT-STR  PIC Z(2).
       01 WS-STORE-FOUR-REC-COUNT-STR   PIC Z(2).
       01 WS-STORE-FIVE-REC-COUNT-STR   PIC Z(2).
       01 WS-STORE-TWELVE-REC-COUNT-STR PIC Z(2).

       01 WS-STORE-ONE-TALLY            PIC $ZZ,ZZ9.99.
       01 WS-STORE-TWO-TALLY            PIC $ZZ,ZZ9.99.
       01 WS-STORE-THREE-TALLY          PIC $ZZ,ZZ9.99.
       01 WS-STORE-FOUR-TALLY           PIC $ZZ,ZZ9.99.
       01 WS-STORE-FIVE-TALLY           PIC $ZZ,ZZ9.99.
       01 WS-STORE-TWELVE-TALLY         PIC $ZZ,ZZ9.99.

       01 WS-STORE-ONE-R-TALLY          PIC $ZZ9.99.
       01 WS-STORE-TWO-R-TALLY          PIC $ZZ9.99.
       01 WS-STORE-THREE-R-TALLY        PIC $ZZ9.99.
       01 WS-STORE-FOUR-R-TALLY         PIC $ZZ9.99.
       01 WS-STORE-FIVE-R-TALLY         PIC $ZZ9.99.
       01 WS-STORE-TWELVE-R-TALLY       PIC $ZZ9.99.

       01 WS-CREDIT-PERCENT-STR         PIC Z9.99.
       01 WS-DEBIT-PERCENT-STR          PIC Z9.99.
       01 WS-CASH-PERCENT-STR           PIC Z9.99.

        PROCEDURE DIVISION.

      * THIS PARAGRAPH IS THE THING THAT RUNS THE APPLICATION.
      * 1) OPEN THE FILE
      * 2) PERFORM THESE THINGS UNTIL THE END OF THE FILE IS REACHED.
      *    A) READ THE FILE
      *    B) SPLIT THE SALES, LAYAWAYS, AND RETURNS VIA PARAGRAPH 200
      *    C) ADD TO COUNTER EVERY TIME A ROW IS PROCESSED COMPLETELY
      * 3) CREATE A SALES SUMMARY
      * 4) CLOSE THE FILE.
      *
       000-MAIN.
           PERFORM 100-OPEN-FILES.
           PERFORM UNTIL EOF
                   PERFORM 150-READ-FILES
                   PERFORM 200-PROCESS-RECORDS
                   ADD 1                  TO WS-TOTAL-ROW-COUNTER
           END-PERFORM.
           PERFORM 890-SALES-SUMMARY.
           PERFORM 900-CLOSE-FILES.
           GOBACK.

      * OPEN ALL INPUT AND OUTPUT FILES THE APPLICATION NEEDS.
       100-OPEN-FILES.
           OPEN INPUT INPUT-FILE.
           OPEN OUTPUT OUTPUT-FILE.
           OPEN OUTPUT SALE_LAY_OUTFILE.
           OPEN OUTPUT RETURNED_OUTFILE.

      * READ EACH AND EVERY ROW IN THE DATASET
       150-READ-FILES.
           READ INPUT-FILE
           AT END
              SET EOF TO TRUE
           END-READ.

      * THIS PARAGRAPH SPLITS THE DATA BY TRANSACTION CODES
       200-PROCESS-RECORDS.
           MOVE IL-TRANSACTION-CODE      TO WS-TRANS-CODE-SALES-OPTIONS.
           MOVE IL-PAYMENT-TYPE           TO WS-PAYMENT-TYPE-OPTIONS.
           PERFORM 210-SPLITTER.
           PERFORM 220-SPLIT-BY-PAYMENT.
           PERFORM 230-SPLIT-BY-AMOUNT.
           PERFORM 240-SPLIT-AMOUNT-PER-STORE.

      * SPLIT BY TRANSACTION CODE [SALES, LAYAWAYS, RETURNS]
       210-SPLITTER.
           IF TCSO-SALES THEN
              PERFORM 300-SPLIT-SALES
              ADD 1                       TO WS-SALES-COUNT
           END-IF.

           IF TCSO-LAYAWAYS THEN
              PERFORM 300-SPLIT-SALES
              ADD 1                       TO WS-LAYAWAY-COUNT
           END-IF.

           IF TCSO-RETURNED THEN
              PERFORM 350-SPLIT-RETURNS
              ADD 1                       TO WS-RETURN-COUNT
           END-IF.

      *    THIS CALCULATES THE MONETARY VALUE OF SALES AND LAYAWAYS.
           ADD WS-TOTAL-S-AMOUNT          TO WS-TOTAL-L-AMOUNT GIVING
              WS-TOTAL-SL-AMOUNT.

      * THIS SPLITS THE SALES AND LAYAWAYS INTO PAYMENT TYPES, THEN
      * COUNTS EACH PAYMENT TYPE FOR REPORTING PURPOSES.
       220-SPLIT-BY-PAYMENT.
           IF PTO-DEBIT THEN
              ADD 1                       TO WS-TOTAL-DEBIT-COUNTER
           END-IF.
           IF PTO-CREDIT THEN
              ADD 1                       TO WS-TOTAL-CREDIT-COUNTER
           END-IF.
           IF PTO-CASH THEN
              ADD 1                       TO WS-TOTAL-CASH-COUNTER
           END-IF.

           ADD WS-TOTAL-DEBIT-COUNTER     TO WS-TOTAL-CREDIT-COUNTER
              GIVING WS-TOTAL-DB-CR.

           ADD WS-TOTAL-DB-CR             TO WS-TOTAL-CASH-COUNTER
              GIVING WS-TOTAL-TRANSACTIONS.

      * THIS TAKES THE MONETARY AMOUNT OF EACH TRANSACTON CODE THEN
      * MAKES A RUNNING TOTAL OF EACH SALE, LAYAWAY, AND RETURN.
       230-SPLIT-BY-AMOUNT.
           EVALUATE TRUE

           WHEN TCSO-SALES
                ADD IL-TRANSACTION-AMOUNT TO WS-TOTAL-S-AMOUNT
                MOVE WS-TOTAL-S-AMOUNT    TO WS-TOTAL-S-AMOUNT-TALLY

           WHEN TCSO-LAYAWAYS
                ADD IL-TRANSACTION-AMOUNT TO WS-TOTAL-L-AMOUNT
                MOVE WS-TOTAL-L-AMOUNT    TO WS-TOTAL-L-AMOUNT-TALLY

           WHEN TCSO-RETURNED
                ADD IL-TRANSACTION-AMOUNT TO WS-TOTAL-R-AMOUNT
                MOVE WS-TOTAL-R-AMOUNT    TO WS-TOTAL-R-AMOUNT-TALLY

           END-EVALUATE.

      * THIS PARAGRAPH SPLITS SALES AND LAYAWAYS BY STORE NUMBER.
      * THEN IT IS FURTHER SPLIT BY RETURNS AND THIER COUNTS.
      * NOTE: THE STORE CODES ARE 01,02,03,04,05,12
       240-SPLIT-AMOUNT-PER-STORE.
           MOVE IL-TRANSACTION-CODE TO WS-TRANSACTION-CODE.
           MOVE SPACES TO OUTPUT-LINE.
           IF IL-STORE-NUMBER = 01

              ADD 1 TO WS-STORE-ONE-REC-COUNT
              IF TCSO-SALES OR TCSO-LAYAWAYS
                 ADD IL-TRANSACTION-AMOUNT TO WS-STORE-ONE-COUNT
              END-IF

              IF TCSO-RETURNED
                 ADD IL-TRANSACTION-AMOUNT TO WS-STORE-ONE-R-COUNT
              END-IF

           END-IF.

           MOVE SPACES TO OUTPUT-LINE.

           IF IL-STORE-NUMBER = 02

              ADD 1 TO WS-STORE-TWO-REC-COUNT
              IF TCSO-SALES OR TCSO-LAYAWAYS
                 ADD IL-TRANSACTION-AMOUNT TO WS-STORE-TWO-COUNT
              END-IF

              IF TCSO-RETURNED
                 ADD IL-TRANSACTION-AMOUNT TO WS-STORE-TWO-R-COUNT
              END-IF

           END-IF.

           MOVE SPACES TO OUTPUT-LINE.
           IF IL-STORE-NUMBER = 03

              ADD 1 TO WS-STORE-THREE-REC-COUNT
              IF TCSO-SALES OR TCSO-LAYAWAYS
                 ADD IL-TRANSACTION-AMOUNT TO WS-STORE-THREE-COUNT
              END-IF

              IF TCSO-RETURNED
                 ADD IL-TRANSACTION-AMOUNT TO WS-STORE-THREE-R-COUNT
              END-IF

           END-IF.

           MOVE SPACES TO OUTPUT-LINE.
           IF IL-STORE-NUMBER = 04

              ADD 1 TO WS-STORE-FOUR-REC-COUNT
              IF TCSO-SALES OR TCSO-LAYAWAYS
                 ADD IL-TRANSACTION-AMOUNT TO WS-STORE-FOUR-COUNT
              END-IF

              IF TCSO-RETURNED
                 ADD IL-TRANSACTION-AMOUNT
                    TO WS-STORE-FOUR-R-COUNT
              END-IF

           END-IF.

           IF IL-STORE-NUMBER = 05

              ADD 1 TO WS-STORE-FIVE-REC-COUNT
              IF TCSO-SALES OR TCSO-LAYAWAYS
                 ADD IL-TRANSACTION-AMOUNT TO WS-STORE-FIVE-COUNT
              END-IF

              IF TCSO-RETURNED
                 ADD IL-TRANSACTION-AMOUNT
                    TO WS-STORE-FIVE-R-COUNT
              END-IF

           END-IF.

           MOVE SPACES TO OUTPUT-LINE.
           IF IL-STORE-NUMBER = 12

              ADD 1 TO WS-STORE-TWELVE-REC-COUNT
              IF TCSO-SALES OR TCSO-LAYAWAYS
                 ADD IL-TRANSACTION-AMOUNT TO WS-STORE-TWELVE-COUNT
              END-IF

              IF TCSO-RETURNED
                 ADD IL-TRANSACTION-AMOUNT TO WS-STORE-TWELVE-R-COUNT
              END-IF

           END-IF.

           ADD WS-TOTAL-S-AMOUNT-TALLY  TO WS-TOTAL-L-AMOUNT-TALLY
              GIVING WS-SUBTOTAL.

           SUBTRACT WS-SUBTOTAL FROM WS-TOTAL-R-AMOUNT-TALLY
              GIVING WS-GRAND-TOTAL.

       300-SPLIT-SALES.
           MOVE INPUT-LINE              TO SALE_LAY_OUTLINE.
           WRITE SALE_LAY_OUTLINE.

       350-SPLIT-RETURNS.
           MOVE INPUT-LINE              TO RETURNED_OUTLINE.
           WRITE RETURNED_OUTLINE.

      *  INTEGER & DECIMAL TO STRING CONVERSION FOR OUTPUT
       890-SALES-SUMMARY.
           MOVE WS-SALES-COUNT          TO WS-SALES-COUNT-STR.
           MOVE WS-LAYAWAY-COUNT        TO WS-LAYAWAY-COUNT-STR.
           MOVE WS-RETURN-COUNT         TO WS-RETURN-COUNT-STR.
           MOVE WS-TOTAL-DEBIT-COUNTER  TO WS-TOTAL-DEBIT-COUNTER-STR.
           MOVE WS-TOTAL-CREDIT-COUNTER TO WS-TOTAL-CREDIT-COUNTER-STR.
           MOVE WS-TOTAL-CASH-COUNTER   TO WS-TOTAL-CASH-COUNTER-STR.


      *    COUNTS
           MOVE SPACES TO OUTPUT-LINE.
           STRING "             SALES COUNT: ", WS-SALES-COUNT-STR
              DELIMITED BY SIZE INTO OUTPUT-LINE.
           WRITE OUTPUT-LINE.

           MOVE SPACES TO OUTPUT-LINE.
           STRING "           LAYAWAY COUNT: ", WS-LAYAWAY-COUNT-STR
              DELIMITED BY SIZE INTO OUTPUT-LINE.
           WRITE OUTPUT-LINE.

           MOVE SPACES TO OUTPUT-LINE.
           STRING "            RETURN COUNT: ", WS-RETURN-COUNT-STR
              DELIMITED BY SIZE INTO OUTPUT-LINE.
           WRITE OUTPUT-LINE.

           MOVE SPACES TO OUTPUT-LINE.
           STRING "              TOTAL ROWS: ", WS-TOTAL-ROW-COUNTER
              DELIMITED BY SIZE INTO OUTPUT-LINE.
           WRITE OUTPUT-LINE.

           MOVE SPACES TO OUTPUT-LINE.
           WRITE OUTPUT-LINE.


      *    MONETARY AMOUNTS
           MOVE SPACES TO OUTPUT-LINE.
           MOVE WS-TOTAL-S-AMOUNT       TO WS-TOTAL-S-AMOUNT-STR.
           MOVE WS-TOTAL-L-AMOUNT       TO WS-TOTAL-L-AMOUNT-STR.
           MOVE WS-TOTAL-R-AMOUNT       TO WS-TOTAL-R-AMOUNT-STR.
           MOVE WS-TOTAL-SL-AMOUNT      TO WS-TOTAL-SL-AMOUNT-STR.

      *    OUTPUT AMOUNTS PER TRANSACTION CODE
           MOVE SPACES TO OUTPUT-LINE.
           STRING "            SALES AMOUNT: ", WS-TOTAL-S-AMOUNT-STR
              DELIMITED BY SIZE INTO OUTPUT-LINE.
           WRITE OUTPUT-LINE.

           MOVE SPACES TO OUTPUT-LINE.
           STRING "          LAYAWAY AMOUNT: ", WS-TOTAL-L-AMOUNT-STR
              DELIMITED BY SIZE INTO OUTPUT-LINE.
           WRITE OUTPUT-LINE.

           MOVE SPACES TO OUTPUT-LINE.
           STRING "           RETURN AMOUNT: ", WS-TOTAL-R-AMOUNT-STR
              DELIMITED BY SIZE INTO OUTPUT-LINE.
           WRITE OUTPUT-LINE.

           MOVE SPACES TO OUTPUT-LINE.
           MOVE WS-TOTAL-SL-AMOUNT TO WS-TOTAL-SL-AMOUNT-STR.
           STRING "        TOTAL S&L AMOUNT: ", WS-TOTAL-SL-AMOUNT-STR
              DELIMITED BY SIZE INTO OUTPUT-LINE.
           WRITE OUTPUT-LINE.

           MOVE SPACES TO OUTPUT-LINE.
           WRITE OUTPUT-LINE.


      *    OUTPUT FOR TRANSACTIONS PER PAYMENT TYPE.
           MOVE SPACES TO OUTPUT-LINE.
           STRING "      DEBIT TRANSACTIONS: ",
                  WS-TOTAL-DEBIT-COUNTER-STR DELIMITED BY SIZE
              INTO OUTPUT-LINE.
           WRITE OUTPUT-LINE.

           MOVE SPACES TO OUTPUT-LINE.
           STRING "     CREDIT TRANSACTIONS: ",
                  WS-TOTAL-CREDIT-COUNTER-STR DELIMITED BY SIZE
              INTO OUTPUT-LINE.
           WRITE OUTPUT-LINE.

           MOVE SPACES TO OUTPUT-LINE.
           STRING "       CASH TRANSACTIONS: ",
                  WS-TOTAL-CASH-COUNTER-STR DELIMITED BY SIZE
              INTO OUTPUT-LINE.
           WRITE OUTPUT-LINE.

      *    OUTPUT FOR TRANSACTIONS PROCESSED [LITERALLY A ROW COUNTER]
           MOVE SPACES TO OUTPUT-LINE.
           MOVE WS-TOTAL-TRANSACTIONS   TO WS-TOTAL-TRANSACTIONS-STR.
           STRING "  TRANSACTIONS PROCESSED: ",
                  WS-TOTAL-TRANSACTIONS-STR DELIMITED BY SIZE INTO
              OUTPUT-LINE.
           WRITE OUTPUT-LINE.

      *    PERCENT CALCULATIONS [NOT ACCURATE]
           COMPUTE WS-CREDIT-PERCENT =
              (
              WS-TOTAL-CREDIT-COUNTER * 1.00 / WS-TOTAL-TRANSACTIONS
              ) * 100.

           COMPUTE WS-DEBIT-PERCENT =
              (
              WS-TOTAL-DEBIT-COUNTER * 1.00 / WS-TOTAL-TRANSACTIONS
              ) * 100.

           COMPUTE WS-CASH-PERCENT =
              (
              WS-TOTAL-CASH-COUNTER * 1.00 / WS-TOTAL-TRANSACTIONS
              ) * 100.

           MOVE SPACES TO OUTPUT-LINE.
           WRITE OUTPUT-LINE.

      *    OUTPUT FOR THE CALCULATED PERCENTAGES
           MOVE SPACES TO OUTPUT-LINE.
           MOVE WS-CREDIT-PERCENT       TO WS-CREDIT-PERCENT-STR.
           MOVE WS-DEBIT-PERCENT        TO WS-DEBIT-PERCENT-STR.
           MOVE WS-CASH-PERCENT         TO WS-CASH-PERCENT-STR.

           STRING " CREDIT PURCHASE PERCENT: " WS-CREDIT-PERCENT-STR
              DELIMITED BY SIZE INTO OUTPUT-LINE.
           WRITE OUTPUT-LINE.

           STRING "  DEBIT PURCHASE PERCENT: " WS-DEBIT-PERCENT-STR
              DELIMITED BY SIZE INTO OUTPUT-LINE.
           WRITE OUTPUT-LINE.

           STRING "   CASH PURCHASE PERCENT: " WS-CASH-PERCENT-STR
              DELIMITED BY SIZE INTO OUTPUT-LINE.
           WRITE OUTPUT-LINE.

      *    STORE NUMBER AMOUNTS
      *    MOVE THE RAW DATA IN THE COUNT TO THE FORMATTED TALLY ($)
           MOVE SPACES TO OUTPUT-LINE.
           MOVE WS-STORE-ONE-COUNT      TO WS-STORE-ONE-TALLY
           MOVE WS-STORE-TWO-COUNT      TO WS-STORE-TWO-TALLY
           MOVE WS-STORE-THREE-COUNT    TO WS-STORE-THREE-TALLY
           MOVE WS-STORE-FOUR-COUNT     TO WS-STORE-FOUR-TALLY
           MOVE WS-STORE-FIVE-COUNT     TO WS-STORE-FIVE-TALLY
           MOVE WS-STORE-TWELVE-COUNT   TO WS-STORE-TWELVE-TALLY

           MOVE WS-STORE-ONE-R-COUNT    TO WS-STORE-ONE-R-TALLY.
           MOVE WS-STORE-TWO-R-COUNT    TO WS-STORE-TWO-R-TALLY.
           MOVE WS-STORE-THREE-R-COUNT  TO WS-STORE-THREE-R-TALLY.
           MOVE WS-STORE-FOUR-R-COUNT   TO WS-STORE-FOUR-R-TALLY.
           MOVE WS-STORE-FIVE-R-COUNT   TO WS-STORE-FIVE-R-TALLY.
           MOVE WS-STORE-TWELVE-R-COUNT TO WS-STORE-TWELVE-R-TALLY.

           MOVE WS-STORE-ONE-REC-COUNT  TO WS-STORE-ONE-REC-COUNT-STR.
           MOVE WS-STORE-TWO-REC-COUNT  TO WS-STORE-TWO-REC-COUNT-STR.

           MOVE WS-STORE-THREE-REC-COUNT
           TO   WS-STORE-THREE-REC-COUNT-STR.

           MOVE WS-STORE-FOUR-REC-COUNT TO WS-STORE-FOUR-REC-COUNT-STR.
           MOVE WS-STORE-FIVE-REC-COUNT TO WS-STORE-FIVE-REC-COUNT-STR.

           MOVE WS-STORE-TWELVE-REC-COUNT
           TO   WS-STORE-TWELVE-REC-COUNT-STR.

           MOVE SPACES TO OUTPUT-LINE.
           WRITE OUTPUT-LINE.

      *    OUTPUTS FOR THE STATS PER STORE NUMBER
           MOVE SPACES TO OUTPUT-LINE.
           STRING "               STORE 1 #: ",
                  WS-STORE-ONE-REC-COUNT-STR DELIMITED BY SIZE
                  INTO OUTPUT-LINE.
           WRITE OUTPUT-LINE.

           MOVE SPACES TO OUTPUT-LINE.
           STRING "              STORE 1 SL: ",
                  WS-STORE-ONE-TALLY DELIMITED BY SIZE INTO OUTPUT-LINE.
           WRITE OUTPUT-LINE.

           MOVE SPACES TO OUTPUT-LINE.
           STRING "               STORE 1 R: ",
                  WS-STORE-ONE-R-TALLY DELIMITED BY SIZE
                  INTO OUTPUT-LINE.
           WRITE OUTPUT-LINE.

           MOVE SPACES TO OUTPUT-LINE.
           WRITE OUTPUT-LINE.

           MOVE SPACES TO OUTPUT-LINE.
           STRING "               STORE 2 #: ",
                  WS-STORE-TWO-REC-COUNT-STR DELIMITED BY SIZE
                  INTO OUTPUT-LINE.
           WRITE OUTPUT-LINE.

           MOVE SPACES TO OUTPUT-LINE.
           STRING "              STORE 2 SL: ", WS-STORE-TWO-TALLY
              DELIMITED BY SIZE INTO OUTPUT-LINE.
           WRITE OUTPUT-LINE.

           MOVE SPACES TO OUTPUT-LINE.
           STRING "               STORE 2 R: ",
                  WS-STORE-TWO-R-TALLY DELIMITED BY SIZE
                  INTO OUTPUT-LINE.
           WRITE OUTPUT-LINE.

           MOVE SPACES TO OUTPUT-LINE.
           WRITE OUTPUT-LINE.

           MOVE SPACES TO OUTPUT-LINE.
           STRING "               STORE 3 #: ",
                  WS-STORE-THREE-REC-COUNT-STR DELIMITED BY SIZE
                  INTO OUTPUT-LINE.
           WRITE OUTPUT-LINE.

           MOVE SPACES TO OUTPUT-LINE.
           STRING "              STORE 3 SL: ",
                  WS-STORE-THREE-TALLY DELIMITED BY SIZE
                  INTO OUTPUT-LINE.
           WRITE OUTPUT-LINE.

           MOVE SPACES TO OUTPUT-LINE.
           STRING "               STORE 3 R: ",
                  WS-STORE-THREE-R-TALLY DELIMITED BY SIZE
                  INTO OUTPUT-LINE.
           WRITE OUTPUT-LINE.

           MOVE SPACES TO OUTPUT-LINE.
           WRITE OUTPUT-LINE.

           MOVE SPACES TO OUTPUT-LINE.
           STRING "               STORE 4 #: ",
                  WS-STORE-FOUR-REC-COUNT-STR DELIMITED BY SIZE
                  INTO OUTPUT-LINE.
           WRITE OUTPUT-LINE.

           MOVE SPACES TO OUTPUT-LINE.
           STRING "              STORE 4 SL: ",
                  WS-STORE-FOUR-TALLY DELIMITED BY SIZE
                  INTO OUTPUT-LINE.
           WRITE OUTPUT-LINE.

           MOVE SPACES TO OUTPUT-LINE.
           STRING "               STORE 4 R: ", WS-STORE-FOUR-R-TALLY
              DELIMITED BY SIZE INTO OUTPUT-LINE.
           WRITE OUTPUT-LINE.

           MOVE SPACES TO OUTPUT-LINE.
           WRITE OUTPUT-LINE.

           MOVE SPACES TO OUTPUT-LINE.
           STRING "               STORE 5 #: ",
                  WS-STORE-FIVE-REC-COUNT-STR DELIMITED BY SIZE
                  INTO OUTPUT-LINE.
           WRITE OUTPUT-LINE.

           MOVE SPACES TO OUTPUT-LINE.
           STRING "              STORE 5 SL: ",
                  WS-STORE-FIVE-TALLY DELIMITED BY SIZE
                  INTO OUTPUT-LINE.
           WRITE OUTPUT-LINE.

           MOVE SPACES TO OUTPUT-LINE.
           STRING "               STORE 5 R: ",
                  WS-STORE-FIVE-R-TALLY DELIMITED BY SIZE
                  INTO OUTPUT-LINE.
           WRITE OUTPUT-LINE.

           MOVE SPACES TO OUTPUT-LINE.
           WRITE OUTPUT-LINE.

           MOVE SPACES TO OUTPUT-LINE.
           STRING "              STORE 12 #: ",
                  WS-STORE-TWELVE-REC-COUNT-STR DELIMITED BY SIZE
                  INTO OUTPUT-LINE.
           WRITE OUTPUT-LINE.

           MOVE SPACES TO OUTPUT-LINE.
           STRING "             STORE 12 SL: ", WS-STORE-TWELVE-TALLY
              DELIMITED BY SIZE INTO OUTPUT-LINE.
           WRITE OUTPUT-LINE.

           MOVE SPACES TO OUTPUT-LINE.
           STRING "              STORE 12 R: ", WS-STORE-TWELVE-R-TALLY
              DELIMITED BY SIZE INTO OUTPUT-LINE.
           WRITE OUTPUT-LINE.

           MOVE SPACES TO OUTPUT-LINE.
           WRITE OUTPUT-LINE.

      *    ADDS ALL SALES AND LAYAWAYS THEN SUBTRACTS THE RETURNS
      *    TO GET THE GRAND TOTAL, THEN CONVERT IT TO A STRING.
           MOVE WS-GRAND-TOTAL TO WS-GRAND-TOTAL-STR.

           STRING "             GRAND TOTAL: ", WS-GRAND-TOTAL-STR
              DELIMITED BY SIZE INTO OUTPUT-LINE.
           WRITE OUTPUT-LINE.

      * CLOSES ALL FILES REQUIRED BY THE APPLICATION.
       900-CLOSE-FILES.
           CLOSE INPUT-FILE.
           CLOSE OUTPUT-FILE.
           CLOSE SALE_LAY_OUTFILE.
           CLOSE RETURNED_OUTFILE.

        END PROGRAM A7SPLIT.
