//RD09A8      JOB
/*
/* SET OUTFILE DD NAME TO MATCH YOUR ASSIGN NAME FOR FILE
/* SET LRECL 108 FOR OUTFILE TO MATCH YOUR OUTPUT RECORD SIZE
/*
//A8R        EXEC PGM=A8SL
//STEPLIB      DD DSN=KC03D09.DCMAFD01.COBOL.LOADLIB,
//    DISP=SHR

//INFILE       DD DSN=KC03D09.DCMAFD01.A7.SLOUT.DATA,
//    DISP=SHR

//OUTFILE      DD DSN=KC03D09.DCMAFD01.A8.SLRPT.OUT,
//    DISP=(NEW,CATLG,DELETE),
//    SPACE=(TRK,(2,1)),
//    RECFM=F,
//    LRECL=101

/*
