//RD09A2      JOB
/*
/* SET OUTFILE DD NAME TO MATCH YOUR ASSIGN NAME FOR FILE
/* SET LRECL 145 FOR OUTFILE TO MATCH YOUR OUTPUT RECORD SIZE
/*
//A1R        EXEC PGM=A1SRPT1B
//STEPLIB      DD DSN=KC03D09.DCMAFD01.COBOL.LOADLIB,
//    DISP=SHR
//INFILE       DD DSN=KC03D09.DCMAFD02.A1.NG1B.DATA,
//    DISP=SHR
//OUTFILE       DD DSN=KC03D09.DCMAFD02.A1.RPT1B.OUT,
//    DISP=(NEW,CATLG,DELETE),
//    SPACE=(TRK,(2,1)),
//    RECFM=F,
//    LRECL=145
/*
