       IDENTIFICATION DIVISION.
       PROGRAM-ID. A1SRPT1A.
       DATE-WRITTEN. SEPTEMBER 6, 2024.
       AUTHOR. RAMIYAN GANGATHARAN.
      * DESCRIPTION: COBOL FILE FOR ASSIGNMENT 1 (MAINFRAME II)

       ENVIRONMENT DIVISION.

       CONFIGURATION SECTION.

       INPUT-OUTPUT SECTION.

       FILE-CONTROL.
           SELECT INPUT-FILE
           ASSIGN TO INFILE
           ORGANIZATION IS SEQUENTIAL.

           SELECT OUTPUT-FILE
           ASSIGN TO OUTFILE
           ORGANIZATION IS SEQUENTIAL.

       DATA DIVISION.

       FILE SECTION.

       FD INPUT-FILE
           RECORDING MODE IS F
           DATA RECORD IS INPUT-LINE
           RECORD CONTAINS 36 CHARACTERS.

