//RD09A9      JOB
/*
/* SET OUTFILE DD NAME TO MATCH YOUR ASSIGN NAME FOR FILE
/* SET LRECL 108 FOR OUTFILE TO MATCH YOUR OUTPUT RECORD SIZE
/*
//A9R        EXEC PGM=A9RET
//STEPLIB      DD DSN=KC03D09.DCMAFD01.COBOL.LOADLIB,
//    DISP=SHR

//INFILE       DD DSN=KC03D09.DCMAFD01.A7.ROUT.DATA,
//    DISP=SHR

//OUTFILE      DD DSN=KC03D09.DCMAFD01.A9.RRPT.OUT,
//    DISP=(NEW,CATLG,DELETE),
//    SPACE=(TRK,(2,1)),
//    RECFM=F,
//    LRECL=86
/*
